export default class GFDegreeProficiencyDataConfig {

    static config: {
        gong_fa_inAll?: { [type: number]: number[] },

    } = {
            gong_fa_inAll: {
                1: [ //攻击增加熟练度
                    1000,
                    1400,
                    2000,
                    2800,
                    3800,
                    5000,
                    6400,
                    8000,
                    9800,
                ],
                2: [//杀敌增加熟练度
                    450,
                    495,
                    585,
                    720,
                    900,
                    1125,
                    1395,
                    1710,
                    2070,
                ],
                3: [//释放技能增加熟练度
                    48,
                    60,
                    78,
                    102,
                    138,
                    174,
                    216,
                    264,
                    318,
                ],
                4: [//技能造成伤害增加熟练度
                    60,
                    90,
                    150,
                    240,
                    360,
                    510,
                    690,
                    900,
                    1140
                ],
                5: [//造成任意伤害增加熟练度
                    1320,
                    1870,
                    2750,
                    3960,
                    5500,
                    7370,
                    9570,
                    12100,
                    14960
                ]

            },
        };
}