
/**
 * 
 */

export default class UnitFetterEffectSimple {

    static config: {
        [key: string]: {
            textShow?: string[][],
            simpleConfig?: { [key: string]: { name?: string, effect?: string } },
            simpleConfigTwo?: { [key: string]: { name?: string, effect?: string } },

        }
    } = {
            'Q0ou': {
                textShow: [
                    [
                        '小松琉圣:金刚天风触发几率提高5%',
                        '本多理:强袭触发时额外造成1000点伤害',
                        '大桥直美:经商每秒对周围的敌人造成200点魔法伤害',
                        '北川尤娜:抢劫发动时额外造成攻击力*3的物理伤害',
                        '福冈乃:天降冰山会对500范围内的敌人造成1000点冰冻伤害',
                        '土田结人:召唤巨鸡召唤时间间隔减少5秒',
                    ],
                    ['本多理', '大桥直美', '北川尤娜', '福冈乃', '土田结人'],
                    ['佐野野', '羁绊内英雄木元素伤害增加2000']
                ],
                simpleConfig: {
                    'Q18n': { name: '本多理', effect: '' },
                    'Q191': { name: '大桥直美', effect: '' },
                    'Q199': { name: '北川尤娜', effect: '' },
                    'Q19h': { name: '福冈乃', effect: '' },
                    'Q19s': { name: '土田结人', effect: '' },
                },
                simpleConfigTwo: {
                    'Q18h': { name: '佐野野', effect: '羁绊内英雄木元素伤害增加2000' },
                }
            },
            'Q0ov': {
                textShow: [
                    [
                        '浅井祥:饕风百战每次攻击增加的层数提高至2层',
                        '大木苍汰:地震之力触发几率提高5%',
                        '渡部知子:魔力光炮额外附加1000点火焰伤害',
                        '丁田和会:震击技能时间减少2秒',
                        '大田有里:零度冰封影响到的敌人移动速度减少10%',
                        '福田生:召唤野狼的技能间隔时间减少2秒',
                    ],
                    ['大木苍汰', '渡部知子', '丁田和会', '大田有里', '福田生'],
                    ['大纣豪', '羁绊内英雄木元素暴击伤害增加100%']
                ],
                simpleConfig: {
                    'Q18g': { name: '大木苍汰', effect: '' },
                    'Q18v': { name: '渡部知子', effect: '' },
                    'Q193': { name: '丁田和会', effect: '' },
                    'Q19f': { name: '大田有里', effect: '' },
                    'Q19r': { name: '福田生', effect: '' },
                },
                simpleConfigTwo: {
                    'Q18s': { name: '大纣豪', effect: '羁绊内英雄木元素暴击伤害增加100%' },
                }
            },
            'Q0p0': {
                textShow: [
                    [
                        '江口锦:蚀目狂龙可以叠加20层',
                        '佐野野:巨力额外造成500点物理伤害',
                        '大纣豪:光索并造成敏捷*3的物理伤害',
                        '三木右斗:扫尾每次发动造成力量*3的物理伤害',
                        '立原和宏:隐身偷取触发几率提高10%',
                        '福原贝人:巨熊之力技能间隔时间减少2秒',
                    ],
                    ['佐野野', '大纣豪', '三木右斗', '立原和宏', '福原贝人'],
                    ['关口辉', '羁绊内英雄木元素伤害加成增加30%']
                ],
                simpleConfig: {
                    'Q18h': { name: '佐野野', effect: '' },
                    'Q18s': { name: '大纣豪', effect: '' },
                    'Q194': { name: '三木右斗', effect: '' },
                    'Q19i': { name: '立原和宏', effect: '' },
                    'Q19k': { name: '福原贝人', effect: '' },
                },
                simpleConfigTwo: {
                    'Q19c': { name: '关口辉', effect: '羁绊内英雄木元素伤害加成增加30%' },
                }
            },
            'Q0p1': {
                textShow: [
                    [
                        '谷口亮介:龙吟金刚额外为英雄附魔,每次攻击额外附加1000点魔法伤害',
                        '福本悠也:迅击每次发动能够造成敏捷*3的魔法伤害',
                        '西田里:减甲光环影响的敌对单位额外受到每秒智力*1.2的魔法伤害',
                        '工藤拓人:爪击技能的间隔时间减少2秒',
                        '藤川阳树:冰晶陷阱技能的间隔时间减少2秒',
                        '中井圭悟:召唤平头哥技能的间隔时间减少2秒',
                    ],
                    ['福本悠也', '西田里', '工藤拓人', '藤川阳树', '中井圭悟'],
                    ['福田生', '羁绊内英雄附加伤害+3000']
                ],
                simpleConfig: {
                    'Q18i': { name: '福本悠也', effect: '' },
                    'Q18t': { name: '西田里', effect: '' },
                    'Q198': { name: '工藤拓人', effect: '' },
                    'Q19e': { name: '藤川阳树', effect: '' },
                    'Q19m': { name: '中井圭悟', effect: '' },
                },
                simpleConfigTwo: {
                    'Q19r': { name: '福田生', effect: '羁绊内英雄附加伤害+3000' },
                }
            },
            'Q0p2': {
                textShow: [
                    [
                        '立原美:倒马缠身技能发动的几率提高5%',
                        '松沢牙:残废发动效果能够使得敌人移动速度减少20%，持续时间5秒',
                        '前田佐波:大力发动有5%几率击破敌人护甲15点，持续时间5秒',
                        '大竹卓也:伤口恶化发动时有5%几率额外造成力量*3的物理伤害',
                        '久保奏多:冰晶牢笼技能的间隔时间减少2秒',
                        '楼井野:召唤蜘蛛技能的间隔时间减少2秒',
                    ],
                    ['松沢牙', '前田佐波', '大竹卓也', '久保奏多', '楼井野'],
                    ['佐久间', '羁绊内英雄真实伤害+1000']
                ],
                simpleConfig: {
                    'Q18j': { name: '松沢牙', effect: '' },
                    'Q18p': { name: '前田佐波', effect: '' },
                    'Q192': { name: '大竹卓也', effect: '' },
                    'Q19g': { name: '久保奏多', effect: '' },
                    'Q19p': { name: '楼井野', effect: '' },
                },
                simpleConfigTwo: {
                    'Q197': { name: '佐久间', effect: '羁绊内英雄真实伤害+1000' },
                }
            },
            'Q0p3': {
                textShow: [
                    [
                        '北原祐真:雷霆掌控技能持续时间延长2秒',
                        '三木正宗:蚀甲发动技能额外附加500点真实伤害',
                        '竹田贝斗:光矛牢笼发动技能后，被控制的敌人额外受到智力*3的魔法伤害',
                        '沼田崎:撕咬造成流血效果，使得被攻击的敌人额外受到20%的伤害',
                        '沢田尚子:冰爆冲击技能的间隔时间减少2秒',
                        '满口结人:召唤野猪技能的间隔时间减少2秒',
                    ],
                    ['三木正宗', '竹田贝斗', '沼田崎', '沢田尚子', '满口结人'],
                    ['大桥直美', '羁绊内英雄全额增伤+30%']
                ],
                simpleConfig: {
                    'Q18k': { name: '三木正宗', effect: '' },
                    'Q18u': { name: '竹田贝斗', effect: '' },
                    'Q195': { name: '沼田崎', effect: '' },
                    'Q19d': { name: '沢田尚子', effect: '' },
                    'Q19q': { name: '满口结人', effect: '' },
                },
                simpleConfigTwo: {
                    'Q191': { name: '大桥直美', effect: '羁绊内英雄全额增伤+30%' },
                }
            },
            'Q0p4': {
                textShow: [
                    [
                        '内山奈:魔能爆发每次造成伤害额外造成智力*1.2的魔法伤害',
                        '谷川靳:魔藤缠绕技能发动时对敌人造成敏捷*3的毒素伤害',
                        '和田纯一:打头发动时有5%几率对敌人造成力量*0.8的物理伤害',
                        '黑田章:尖牙发动技能额外造成敏捷*0.8的物理伤害',
                        '原口和纱:减速光环每秒对影响的敌人造成智力*1.2的魔法伤害',
                        '涉谷京香:召唤毒蛇技能的间隔时间减少2秒',
                    ],
                    ['谷川靳', '和田纯一', '黑田章', '原口和纱', '涉谷京香'],
                    ['本多理', '羁绊内英雄木元素暴击几率+5%']
                ],
                simpleConfig: {
                    'Q18l': { name: '谷川靳', effect: '' },
                    'Q18q': { name: '和田纯一', effect: '' },
                    'Q196': { name: '黑田章', effect: '' },
                    'Q19b': { name: '原口和纱', effect: '' },
                    'Q19n': { name: '涉谷京香', effect: '' },
                },
                simpleConfigTwo: {
                    'Q18n': { name: '本多理', effect: '羁绊内英雄木元素暴击几率+5%' },
                }
            },

            'Q0p5': {
                textShow: [
                    [
                        '下田大树:光能衍射造成的伤害提高700点',
                        '森山雄斗:椿木桩技能的间隔时间减少2秒',
                        '长尾阳:神偷技能的间隔时间减少2秒',
                        '田辽悠生:打工发动技能会对周围的随机1个敌人造成力量*3的魔法伤害',
                        '关口辉:冰晶光环每秒对影响的敌人造成智力*0.8的冰冻伤害',
                        '河合香奈:召唤巨人技能的间隔时间减少2秒',
                    ],
                    ['森山雄斗', '长尾阳', '田辽悠生', '关口辉', '河合香奈'],
                    ['竹田贝斗', '羁绊内英雄金元素伤害增加2000']
                ],
                simpleConfig: {
                    'Q18m': { name: '森山雄斗', effect: '' },
                    'Q190': { name: '长尾阳', effect: '' },
                    'Q19a': { name: '田辽悠生', effect: '' },
                    'Q19c': { name: '关口辉', effect: '' },
                    'Q19l': { name: '河合香奈', effect: '' },
                },
                simpleConfigTwo: {
                    'Q18u': { name: '竹田贝斗', effect: '羁绊内英雄金元素伤害增加2000' },
                }
            },
            'Q0p6': {
                textShow: [
                    [
                        '西光希:圣光强化伤害增加比例提高到60%',
                        '本多理:强袭发动有5%几率造成敏捷*3的物理伤害',
                        '大桥直美:经商每秒随机对1个敌人附加一个buff，击杀后金币获得翻倍，buff持续时间2.5秒',
                        '北川尤娜:抢劫发动时，额外造成力量*3的物理伤害',
                        '福冈乃:天降冰山技能的间隔时间减少2秒',
                        '土田结人:召唤巨鸡技能的间隔时间减少2秒',
                    ],
                    ['本多理', '大桥直美', '北川尤娜', '福冈乃', '土田结人'],
                    ['田辽悠生', '羁绊内英雄金元素暴击伤害增加100%']
                ],
                simpleConfig: {
                    'Q18n': { name: '本多理', effect: '' },
                    'Q191': { name: '大桥直美', effect: '' },
                    'Q199': { name: '北川尤娜', effect: '' },
                    'Q19h': { name: '福冈乃', effect: '' },
                    'Q19s': { name: '土田结人', effect: '' },
                },
                simpleConfigTwo: {
                    'Q19a': { name: '田辽悠生', effect: '羁绊内英雄金元素暴击伤害增加100%' },
                }
            },

            'Q0p7': {
                textShow: [
                    [
                        '宫下野:耀斑聚能buff需求降低至30层',
                        '金田健介:过路费发动技能效果时在敌人位置发生爆炸对300范围内敌人造成智力*3的魔法伤害',
                        '秋原夏江:冲击技能的间隔时间减少2秒',
                        '佐久间:龙须缠绕发动技能时额外造成敏捷*3的魔法伤害',
                        '山内加那:悬赏金技能的间隔时间减少2秒',
                        '德田右京:召唤蠕虫技能的间隔时间减少2秒',
                    ],
                    ['金田健介', '秋原夏江', '佐久间', '山内加那', '德田右京'],
                    ['大田有里', '羁绊内英雄金元素伤害加成增加30%']
                ],
                simpleConfig: {
                    'Q18o': { name: '金田健介', effect: '' },
                    'Q18r': { name: '秋原夏江', effect: '' },
                    'Q197': { name: '佐久间', effect: '' },
                    'Q19j': { name: '山内加那', effect: '' },
                    'Q19o': { name: '德田右京', effect: '' },
                },
                simpleConfigTwo: {
                    'Q19f': { name: '大田有里', effect: '羁绊内英雄金元素伤害加成增加30%' },
                }
            },
            'Q0p8': {
                textShow: [
                    [
                        '川岛奏汰:光束聚能伤害能够多传递2个单位',
                        '大木苍汰:地震之力技能发动能够造成力量*3的物理伤害',
                        '和田纯一:打头额外附加真实伤害200点',
                        '工藤拓人:爪击技能造成的伤害忽视20点护甲',
                        '藤川阳树:冰晶陷阱每次发动额外造成智力*3的魔法伤害',
                        '中井圭悟:召唤平头哥继承比例增加15%',
                    ],
                    ['大木苍汰', '和田纯一', '工藤拓人', '藤川阳树', '中井圭悟'],
                    ['涉谷京香', '羁绊内英雄技能附加伤害+3000']
                ],
                simpleConfig: {
                    'Q18g': { name: '大木苍汰', effect: '' },
                    'Q18q': { name: '和田纯一', effect: '' },
                    'Q198': { name: '工藤拓人', effect: '' },
                    'Q19e': { name: '藤川阳树', effect: '' },
                    'Q19m': { name: '中井圭悟', effect: '' },
                },
                simpleConfigTwo: {
                    'Q19n': { name: '涉谷京香', effect: '羁绊内英雄技能附加伤害+3000' },
                }
            },
            'Q0p9': {
                textShow: [
                    [
                        '黑沢帆:超能强化发动增加敏捷提高至50%',
                        '佐野野:巨力发动技能额外造成力量*3的物理伤害',
                        '西田里:减甲光环减少光环影响的敌人护甲10点',
                        '丁田和会:震击发动技能效果对冲击到的敌人额外造成力量*3的魔法伤害',
                        '原口和纱:减速光环发动技能时，增加英雄攻击力10%，持续5秒',
                        '土田结人:召唤巨鸡继承比例增加15%',
                    ],
                    ['佐野野', '西田里', '丁田和会', '原口和纱', '土田结人'],
                    ['三木右斗', '羁绊内英雄魔法暴击伤害+100%']
                ],
                simpleConfig: {
                    'Q18h': { name: '佐野野', effect: '' },
                    'Q18t': { name: '西田里', effect: '' },
                    'Q193': { name: '丁田和会', effect: '' },
                    'Q19b': { name: '原口和纱', effect: '' },
                    'Q19s': { name: '土田结人', effect: '' },
                },
                simpleConfigTwo: {
                    'Q194': { name: '三木右斗', effect: '羁绊内英雄魔法暴击伤害+100%' },
                }
            },
            'Q0pa': {
                textShow: [
                    [
                        '藤本太一:火焱蓄能提高附加伤害600点',
                        '福本悠也:迅击触发几率提高5%',
                        '大桥直美:经商每秒对周围随机1个敌人造成当前金币*3的魔法伤害',
                        '沼田崎:撕咬使其额外受到的伤害提高10%',
                        '久保奏多:冰晶牢笼使得控制的敌人每秒受到智力*1.2的魔法伤害',
                        '德田右京:召唤蠕虫继承比例增加15%',
                    ],
                    ['福本悠也', '大桥直美', '沼田崎', '久保奏多', '德田右京'],
                    ['福原贝人', '羁绊内英雄魔法增伤+30%']
                ],
                simpleConfig: {
                    'Q18i': { name: '福本悠也', effect: '' },
                    'Q191': { name: '大桥直美', effect: '' },
                    'Q195': { name: '沼田崎', effect: '' },
                    'Q19g': { name: '久保奏多', effect: '' },
                    'Q19o': { name: '德田右京', effect: '' },
                },
                simpleConfigTwo: {
                    'Q19k': { name: '福原贝人', effect: '羁绊内英雄魔法增伤+30%' },
                }
            },
            'Q0pb': {
                textShow: [
                    [
                        '冈村树理:毫光集束技能CD减少2秒',
                        '松沢讶:残废每次触发额外造成力量*3的物理伤害',
                        '长尾阳:神偷技能发动效果额外造成智力*3的魔法伤害',
                        '大竹卓也:伤口恶化每次发动技能能够使其造成300点流血效果，持续3秒不叠加',
                        '山内加那:悬赏金能够给2个敌人附加buff',
                        '河合香奈:召唤巨人继承比例增加15%',
                    ],
                    ['松沢牙', '长尾阳', '大竹卓也', '山内加那', '河合香奈'],
                    ['三木正宗', '羁绊内英雄金元素暴击几率+5%']
                ],
                simpleConfig: {
                    'Q18j': { name: '松沢牙', effect: '' },
                    'Q190': { name: '长尾阳', effect: '' },
                    'Q192': { name: '大竹卓也', effect: '' },
                    'Q19j': { name: '山内加那', effect: '' },
                    'Q19l': { name: '河合香奈', effect: '' },
                },
                simpleConfigTwo: {
                    'Q18k': { name: '三木正宗', effect: '羁绊内英雄金元素暴击几率+5%' },
                }
            },
            'Q0pc': {
                textShow: [
                    [
                        '远藤悠雅:神力霸体额外增加力量30%',
                        '三木正宗:蚀甲减甲效果每层提高0.5点',
                        '渡部知子:魔力光炮技能CD减少2秒',
                        '田辽悠生:打工每次发动技能效果，增加自身攻击速度30%',
                        '沢田尚子:冰爆冲击发动技能效果额外对敌人造成智力*3的冰冻伤害',
                        '佐久间:龙须缠绕技能CD减少2秒',
                    ],
                    ['三木正宗', '渡部知子', '田辽悠生', '沢田尚子', '佐久间'],
                    ['立原和宏', '羁绊内英雄火元素伤害增加2000']
                ],
                simpleConfig: {
                    'Q18k': { name: '三木正宗', effect: '' },
                    'Q18v': { name: '渡部知子', effect: '' },
                    'Q19a': { name: '田辽悠生', effect: '' },
                    'Q19d': { name: '沢田尚子', effect: '' },
                    'Q197': { name: '佐久间', effect: '' },
                },
                simpleConfigTwo: {
                    'Q19i': { name: '立原和宏', effect: '羁绊内英雄火元素伤害增加2000' },
                }
            },

            'Q0pd': {
                textShow: [
                    [
                        '蹈叶航平:破风巨刃伤害增加提高至50%',
                        '谷川靳:魔藤缠绕缠绕住敌人时，会额会使敌人中毒，每秒受到300点毒素伤害，持续5秒',
                        '前田佐波:大力有5%几率造成力量*3的物理伤害',
                        '北川尤娜:抢劫每次发动效果能过减少敌人护甲15点护甲',
                        '福冈乃:天降冰山发动时对影响到的敌人在之后的5秒移动速度减少30%',
                        '涉谷京香:召唤毒蛇技能的间隔时间减少2秒',
                    ],
                    ['谷川靳', '前田佐波', '北川尤娜', '福冈乃', '涉谷京香'],
                    ['和田纯一', '羁绊内英雄火元素暴击伤害增加100%']
                ],
                simpleConfig: {
                    'Q18l': { name: '谷川靳', effect: '' },
                    'Q18p': { name: '前田佐波', effect: '' },
                    'Q199': { name: '北川尤娜', effect: '' },
                    'Q19h': { name: '福冈乃', effect: '' },
                    'Q19n': { name: '涉谷京香', effect: '' },
                },
                simpleConfigTwo: {
                    'Q18q': { name: '和田纯一', effect: '羁绊内英雄火元素暴击伤害增加100%' },
                }
            },

            'Q0pe': {
                textShow: [
                    [
                        '杉山喜江:天通利爪提高流血效果300点',
                        '森山雄斗:椿木桩技能发动效果额外造成敏捷*3的魔法伤害',
                        '大纣豪:光索缠绕住敌人时，能够造成敏捷*3的火焰伤害，并沉默2秒',
                        '佐久间:龙须缠绕对缠绕住的敌人造成每秒300点的毒素伤害，持续5秒',
                        '大田有里:零度冰封对影响到的敌人每秒造成智力*1.2的魔法伤害',
                        '福原贝人:巨熊之力继承比例增加15%',
                    ],
                    ['森山雄斗', '大纣豪', '佐久间', '大田有里', '福原贝人'],
                    ['中井圭悟', '羁绊内英雄火元素伤害加成增加30%']
                ],
                simpleConfig: {
                    'Q18m': { name: '森山雄斗', effect: '' },
                    'Q18s': { name: '大纣豪', effect: '' },
                    'Q197': { name: '佐久间', effect: '' },
                    'Q19f': { name: '大田有里', effect: '' },
                    'Q19k': { name: '福原贝人', effect: '' },
                },
                simpleConfigTwo: {
                    'Q19m': { name: '中井圭悟', effect: '羁绊内英雄火元素伤害加成增加30%' },
                }
            },

            'Q0pf': {
                textShow: [
                    [
                        '中原良介:神箭锯齿提高附加的真实伤害1000点',
                        '本多理:强袭每次发动效果增加自身攻击速度3%，可叠加10层，持续2秒',
                        '竹田贝斗:光矛牢笼技能间隔减少2秒',
                        '三木右斗:扫尾技能间隔减少2秒',
                        '关口辉:冰晶光环对影响到的敌人移动速度减少20%',
                        '福田生:召唤野狼继承比例增加15%',
                    ],
                    ['本多理', '竹田贝斗', '三木右斗', '关口辉', '福田生'],
                    ['森山雄斗', '羁绊内英雄护甲穿透+30%']
                ],
                simpleConfig: {
                    'Q18n': { name: '本多理', effect: '' },
                    'Q18u': { name: '竹田贝斗', effect: '' },
                    'Q194': { name: '三木右斗', effect: '' },
                    'Q19c': { name: '关口辉', effect: '' },
                    'Q19r': { name: '福田生', effect: '' },
                },
                simpleConfigTwo: {
                    'Q18m': { name: '森山雄斗', effect: '羁绊内英雄护甲穿透+30%' },
                }
            },

            'Q0pg': {
                textShow: [
                    [
                        '长尾加南:双刃切割减少护甲时额外再减少10点',
                        '金田健介:过路费对首次影响到的敌人造成力量*5的物理伤害',
                        '秋原夏江:冲击发动技能果时额外造成力量*3的物理伤害',
                        '黒田章:尖牙减少的护甲每层增加1点',
                        '立原和宏:隐身偷取技能发动时额外造成敏捷*3的物理伤害',
                        '满口结人:召唤野猪继承比例增加15%',
                    ],
                    ['金田健介', '秋原夏江', '黑田章', '立原和宏', '满口结人'],
                    ['满口结人', '羁绊内英雄致命一击+5倍']
                ],
                simpleConfig: {
                    'Q18o': { name: '金田健介', effect: '' },
                    'Q18r': { name: '秋原夏江', effect: '' },
                    'Q196': { name: '黑田章', effect: '' },
                    'Q19i': { name: '立原和宏', effect: '' },
                    'Q19q': { name: '满口结人', effect: '' },
                },
                simpleConfigTwo: {
                    'Q18n': { name: '满口结人', effect: '羁绊内英雄致命一击+5倍' },
                }
            },

            'Q0ph': {
                textShow: [
                    [
                        '丹羽耀:金属掌控造成的伤害提高至20%',
                        '大木苍汰:地震之力发动技能效果影响范围提高至500码',
                        '竹田贝斗:光矛牢笼影响范围提高至400码',
                        '丁田和会:震击释放的冲击波增加1次',
                        '立原和宏:隐身偷取每次触发能够造成攻击力的1.5倍伤害',
                        '河合香奈:召唤巨人持续时间增加2秒',
                    ],
                    ['大木苍汰', '竹田贝斗', '丁田和会', '立原和宏', '河合香奈'],
                    ['黑田章', '羁绊内英雄攻速+30%']
                ],
                simpleConfig: {
                    'Q18g': { name: '大木苍汰', effect: '' },
                    'Q18u': { name: '竹田贝斗', effect: '' },
                    'Q193': { name: '丁田和会', effect: '' },
                    'Q19i': { name: '立原和宏', effect: '' },
                    'Q19l': { name: '河合香奈', effect: '' },
                },
                simpleConfigTwo: {
                    'Q196': { name: '黑田章', effect: '羁绊内英雄攻速+30%' },
                }
            },
            'Q0pi': {
                textShow: [
                    [
                        '平田成美:狱焰强化附加的火焰伤害增加1000点',
                        '佐野野:巨力触发几率提高5%',
                        '秋原夏江:冲击发动时能忽视敌人20%护甲',
                        '黑田章:尖牙附加5点毒素伤害，可以叠加40层，持续时间3秒',
                        '原口和纱:减速光环对影响到的敌人每5秒随机冻结一个敌人，持续1.5秒',
                        '土田结人:召唤巨鸡持续时间增加2秒',
                    ],
                    ['佐野野', '秋原夏江', '黑田章', '原口和纱', '土田结人'],
                    ['藤川阳树', '羁绊内英雄火元素暴击几率+5%']
                ],
                simpleConfig: {
                    'Q18h': { name: '佐野野', effect: '' },
                    'Q18r': { name: '秋原夏江', effect: '' },
                    'Q196': { name: '黑田章', effect: '' },
                    'Q19b': { name: '原口和纱', effect: '' },
                    'Q19s': { name: '土田结人', effect: '' },
                },
                simpleConfigTwo: {
                    'Q19e': { name: '藤川阳树', effect: '羁绊内英雄火元素暴击几率+5%' },
                }
            },
            'Q0pj': {
                textShow: [
                    [
                        '武田裕介:冰刃寒息额外附带1000点冰冻伤害',
                        '福本悠也:迅击造成的伤害能够降低敌人护甲20点，持续3秒',
                        '大桥直美:经商额外每秒获得2点金币',
                        '工藤拓人:爪击能够撕裂敌人的防御，降低敌人护甲和魔抗15%，持续10秒',
                        '沢田尚子:冰爆冲击击退后，移动速度减少10%',
                        '德田右京:召唤蠕虫持续时间增加2秒',
                    ],
                    ['福本悠也', '大桥直美', '工藤拓人', '沢田尚子', '德田右京'],
                    ['北川尤娜', '羁绊内英雄水元素伤害增加2000']
                ],
                simpleConfig: {
                    'Q18i': { name: '福本悠也', effect: '' },
                    'Q191': { name: '大桥直美', effect: '' },
                    'Q198': { name: '工藤拓人', effect: '' },
                    'Q19d': { name: '沢田尚子', effect: '' },
                    'Q19o': { name: '德田右京', effect: '' },
                },
                simpleConfigTwo: {
                    'Q199': { name: '北川尤娜', effect: '羁绊内英雄水元素伤害增加2000' },
                }
            },
            'Q0pk': {
                textShow: [
                    [
                        '吉原康平:破魂斩龙斩杀几率提高1%',
                        '松沢讶:残废触发几率提高5%',
                        '前田佐波:大力每次发动有5%几率眩晕0.5秒',
                        '田辺悠生:打工每隔5秒额外获得8点金币',
                        '渋谷京香:召唤毒蛇继承比例增加15%',
                        '久保奏多:冰晶牢笼影响的敌人移动速度减少10%,持续3秒',
                    ],
                    ['松沢牙', '前田佐波', '田辽悠生', '涉谷京香', '久保奏多'],
                    ['久保奏多', '羁绊内英雄水元素暴击伤害增加100%']
                ],
                simpleConfig: {
                    'Q18j': { name: '松沢牙', effect: '' },
                    'Q18p': { name: '前田佐波', effect: '' },
                    'Q19a': { name: '田辽悠生', effect: '' },
                    'Q19n': { name: '涉谷京香', effect: '' },
                    'Q19g': { name: '久保奏多', effect: '' },
                },
                simpleConfigTwo: {
                    'Q19g': { name: '久保奏多', effect: '羁绊内英雄水元素暴击伤害增加100%' },
                }
            },
            'Q0pl': {
                textShow: [
                    [
                        '小松由子:挂角战龙触发几率提高5%',
                        '三木正宗:蚀甲每次触发有5%几率额外造成敏捷*3的物理伤害',
                        '长尾阳:神偷每次触发技能额外偷取5点金币',
                        '三木右斗:扫尾释放技能20%几率再释放一次',
                        '山内加那:悬赏金给敌人增加buff后，敌人额外受到每秒500点魔法伤害，直到buff消失',
                        '满口结人:召唤野猪持续时间增加2秒',
                    ],
                    ['三木正宗', '长尾阳', '三木右斗', '山内加那', '满口结人'],
                    ['德田右京', '羁绊内英雄水元素伤害加成增加30%']
                ],
                simpleConfig: {
                    'Q18k': { name: '三木正宗', effect: '' },
                    'Q190': { name: '长尾阳', effect: '' },
                    'Q194': { name: '三木右斗', effect: '' },
                    'Q19j': { name: '山内加那', effect: '' },
                    'Q19q': { name: '满口结人', effect: '' },
                },
                simpleConfigTwo: {
                    'Q19o': { name: '德田右京', effect: '羁绊内英雄水元素伤害加成增加30%' },
                }
            },
            'Q0pm': {
                textShow: [
                    [
                        '森下太雅:御风百刀额外发射2把飞刀',
                        '谷川靳:魔藤缠绕技能时间间隔减少2秒',
                        '大纣豪:光索每次击中敌人能够穿透敌人护甲，使其每秒100点流血，持续3秒，可叠加10层',
                        '北川尤娜:抢劫发动技能时，能够眩晕敌人1秒',
                        '关口辉:冰晶光环打击间隔减少cd1秒',
                        '中井圭悟:召唤平头哥持续时间增加2秒',
                    ],
                    ['谷川靳', '大纣豪', '北川尤娜', '关口辉', '中井圭悟'],
                    ['大竹卓也', '羁绊内英雄技能CD+20%']
                ],
                simpleConfig: {
                    'Q18l': { name: '谷川靳', effect: '' },
                    'Q18s': { name: '大纣豪', effect: '' },
                    'Q199': { name: '北川尤娜', effect: '' },
                    'Q19c': { name: '关口辉', effect: '' },
                    'Q19m': { name: '中井圭悟', effect: '' },
                },
                simpleConfigTwo: {
                    'Q192': { name: '大竹卓也', effect: '羁绊内英雄技能CD+20%' },
                }
            },
            'Q0pn': {
                textShow: [
                    [
                        '平松娅栗:白刃连刺触发几率提高10%',
                        '森山雄斗:椿木桩触发影响范围增加100码',
                        '和田纯一:打头触发几率提高5%',
                        '沼田崎:撕咬技能cd减少2秒',
                        '大田有里:零度冰封进入范围超过5秒后，会冰冻1.5秒',
                        '福原贝人:巨熊之力持续时间增加2秒',
                    ],
                    ['森山雄斗', '和田纯一', '沼田崎', '大田有里', '福原贝人'],
                    ['原口和纱', '羁绊内英雄魔法恢复+5']
                ],
                simpleConfig: {
                    'Q18m': { name: '森山雄斗', effect: '' },
                    'Q18q': { name: '和田纯一', effect: '' },
                    'Q195': { name: '沼田崎', effect: '' },
                    'Q19f': { name: '大田有里', effect: '' },
                    'Q19k': { name: '福原贝人', effect: '' },
                },
                simpleConfigTwo: {
                    'Q19b': { name: '原口和纱', effect: '羁绊内英雄魔法恢复+5' },
                }
            },
            'Q0po': {
                textShow: [
                    [
                        '今村敦史:寒霜气息进入范围的敌人每秒受到500点冰冻伤害',
                        '本多理:强袭每次发动技能效果能够使得敌人护甲损失1%，可叠加10层，持续时间3秒',
                        '西田里:减甲光环每秒减少影响到的敌人护甲1点，持续3秒，可叠加20层',
                        '佐久间:龙须缠绕影响的范围提高200码',
                        '福冈乃:天降冰山对敌人额外造成智力*3的魔法伤害',
                        '楼井野:召唤蜘蛛持续时间增加2秒',
                    ],
                    ['本多理', '西田里', '佐久间', '福冈乃', '楼井野'],
                    ['松沢牙', '羁绊内英雄魔抗穿透20%']
                ],
                simpleConfig: {
                    'Q18n': { name: '本多理', effect: '' },
                    'Q18t': { name: '西田里', effect: '' },
                    'Q197': { name: '佐久间', effect: '' },
                    'Q19h': { name: '福冈乃', effect: '' },
                    'Q19p': { name: '楼井野', effect: '' },
                },
                simpleConfigTwo: {
                    'Q18j': { name: '松沢牙', effect: '羁绊内英雄魔抗穿透20%' },
                }
            },
            'Q0pp': {
                textShow: [
                    [
                        '冈有香:飞瀑断流额外增加2道水流冲击敌人',
                        '金田健介:过路费敌人距离英雄每靠近50码则额外受到5%的伤害',
                        '渡部知子:魔力光炮影响范围提高至500码',
                        '大竹卓也:伤口恶化敌人如果受到流血伤害，则额外受到20%的伤害',
                        '藤川阳树:冰晶陷阱影响范围提高至600码',
                        '福田生:召唤野狼造成的伤害额外附加1000点物理伤害',
                    ],
                    ['金田健介', '渡部知子', '大竹卓也', '藤川阳树', '福田生'],
                    ['渡部知子', '羁绊内英雄水元素暴击几率+5%']
                ],
                simpleConfig: {
                    'Q18o': { name: '金田健介', effect: '' },
                    'Q18v': { name: '渡部知子', effect: '' },
                    'Q192': { name: '大竹卓也', effect: '' },
                    'Q19e': { name: '藤川阳树', effect: '' },
                    'Q19r': { name: '福田生', effect: '' },
                },
                simpleConfigTwo: {
                    'Q18v': { name: '渡部知子', effect: '羁绊内英雄水元素暴击几率+5%' },
                }
            },
            'Q0pq': {
                textShow: [
                    [
                        '竹内聪介:巨力强化额外增加5000点力量',
                        '佐野野:巨力发动技能后，能够击破敌人护甲15点，持续3秒',
                        '竹田贝斗:光矛牢笼影响到的敌人额外受到每秒400点的火焰伤害',
                        '工藤拓人:爪击发动技能时额外造成敏捷*3的物理伤害',
                        '藤川阳树:冰晶陷阱敌人受到的冲击结束后，移动速度降低20%，持续2秒',
                        '中井圭悟:召唤平头哥造成的伤害额外附加1000点物理伤害',
                    ],
                    ['佐野野', '竹田贝斗', '工藤拓人', '藤川阳树', '中井圭悟'],
                    ['土田结人', '羁绊内英雄土元素伤害增加2000']
                ],
                simpleConfig: {
                    'Q18h': { name: '佐野野', effect: '' },
                    'Q18u': { name: '竹田贝斗', effect: '' },
                    'Q198': { name: '工藤拓人', effect: '' },
                    'Q19e': { name: '藤川阳树', effect: '' },
                    'Q19m': { name: '中井圭悟', effect: '' },
                },
                simpleConfigTwo: {
                    'Q19s': { name: '土田结人', effect: '羁绊内英雄土元素伤害增加2000' },
                }
            },
            'Q0pr': {
                textShow: [
                    [
                        '黑沢新大:战魂增强战魂强化效果增加20%',
                        '福本悠也:迅击如果敌人受到流血效果，则额外受到10%的伤害',
                        '前田佐波:大力发动效果时有5%几率额外造成力量*3的物理伤害',
                        '北川尤娜:抢劫每次发动技能额外获得金币50点',
                        '久保奏多:冰晶牢笼影响到的敌人额外受到每秒500点冰冻伤害，持续5秒',
                        '德田右京:召唤蠕虫造成的伤害额外附加1000点物理伤害',
                    ],
                    ['福本悠也', '前田佐波', '北川尤娜', '久保奏多', '德田右京'],
                    ['秋原夏江', '羁绊内英雄土元素暴击伤害增加100%']
                ],
                simpleConfig: {
                    'Q18i': { name: '福本悠也', effect: '' },
                    'Q18p': { name: '前田佐波', effect: '' },
                    'Q199': { name: '北川尤娜', effect: '' },
                    'Q19g': { name: '久保奏多', effect: '' },
                    'Q19o': { name: '德田右京', effect: '' },
                },
                simpleConfigTwo: {
                    'Q18r': { name: '秋原夏江', effect: '羁绊内英雄土元素暴击伤害增加100%' },
                }
            },
            'Q0ps': {
                textShow: [
                    [
                        '横田富佐:蛊毒培育降低培育毒虫的时间1秒',
                        '松沢牙:残废发动技能效果后使敌人移动速度降低10%，持续5秒',
                        '和田纯一:打头触发后击破护甲10点，持续3秒',
                        '黑田章:尖牙每个单位可叠加层数提高至6层',
                        '福冈乃:天降冰山影响范围由单体变为影响300范围内的敌人',
                        '土田结人:召唤巨鸡造成的伤害额外附加1000点物理伤害',
                    ],
                    ['松沢牙', '和田纯一', '黑田章', '福冈乃', '土田结人'],
                    ['沢田尚子', '羁绊内英雄土元素伤害加成增加30%']
                ],
                simpleConfig: {
                    'Q18j': { name: '松沢牙', effect: '' },
                    'Q18q': { name: '和田纯一', effect: '' },
                    'Q196': { name: '黑田章', effect: '' },
                    'Q19h': { name: '福冈乃', effect: '' },
                    'Q19s': { name: '土田结人', effect: '' },
                },
                simpleConfigTwo: {
                    'Q19d': { name: '沢田尚子', effect: '羁绊内英雄土元素伤害加成增加30%' },
                }
            },
            'Q0pt': {
                textShow: [
                    [
                        '宫本雅也:剧毒研制杀敌需求降低10个',
                        '三木正宗:蚀甲对敌人的首次伤害能够腐蚀护甲10点，持续5秒，不叠加',
                        '渡部知子:魔力光炮使被炸中的敌人额外受到智力*1.2的火焰伤害，持续3秒',
                        '三木右斗:扫尾对敌人造成击退后，再眩晕1秒',
                        '山内加那:悬赏金给敌人附加的buff持续时间延长2秒',
                        '福原贝人:巨熊之力造成的伤害额外附加1000点物理伤害',
                    ],
                    ['三木正宗', '渡部知子', '三木右斗', '山内加那', '福原贝人'],
                    ['福本悠也', '羁绊内英雄召唤兽附加伤害+3000']
                ],
                simpleConfig: {
                    'Q18k': { name: '三木正宗', effect: '' },
                    'Q18v': { name: '渡部知子', effect: '' },
                    'Q194': { name: '三木右斗', effect: '' },
                    'Q19j': { name: '山内加那', effect: '' },
                    'Q19k': { name: '福原贝人', effect: '' },
                },
                simpleConfigTwo: {
                    'Q18i': { name: '福本悠也', effect: '羁绊内英雄召唤兽附加伤害+3000' },
                }
            },
            'Q0pu': {
                textShow: [
                    [
                        '片山逸美:陷阱精通陷阱造成的伤害额外附加1000点魔法伤害',
                        '谷川靳:魔藤缠绕如果敌人受到毒素伤害时，额外受到10%的伤害',
                        '西田里:减甲光环影响到的敌人每秒损失500点血量',
                        '田辽悠生:打工技能发动时对周围的随机5个敌人附加一个buff，该buff能够使敌人受到的伤害增加15%',
                        '关口辉:冰晶光环间隔时间减低1.5秒',
                        '涉谷京香:召唤毒蛇持续时间增加2秒',
                    ],
                    ['谷川靳', '西田里', '田辽悠生', '关口辉', '涉谷京香'],
                    ['金田健介', '羁绊内英雄召唤兽真实伤害+1000']
                ],
                simpleConfig: {
                    'Q18l': { name: '谷川靳', effect: '' },
                    'Q18t': { name: '西田里', effect: '' },
                    'Q19a': { name: '田辽悠生', effect: '' },
                    'Q19c': { name: '关口辉', effect: '' },
                    'Q19n': { name: '涉谷京香', effect: '' },
                },
                simpleConfigTwo: {
                    'Q18o': { name: '金田健介', effect: '羁绊内英雄召唤兽真实伤害+1000' },
                }
            },

            'Q0pv': {
                textShow: [
                    [
                        '板纣爽太:侍者附魔附加伤害提高1000点',
                        '森山雄斗:椿木桩敌人掉落地上后，移动速度减少10%，持续3秒',
                        '大桥直美:经商每秒消耗10点金币对周围400范围内的敌人造成智力*3的魔法伤害',
                        '沼田崎:撕咬每次触发额外造成力量*3的物理伤害',
                        '大田有里:零度冰封技能间隔减少2秒',
                        '河合香奈:召唤巨人造成的伤害额外附加1000点物理伤害',
                    ],
                    ['森山雄斗', '大桥直美', '沼田崎', '大田有里', '河合香奈'],
                    ['沼田崎', '羁绊内英雄召唤兽全额增伤+30%']
                ],
                simpleConfig: {
                    'Q18m': { name: '森山雄斗', effect: '' },
                    'Q191': { name: '大桥直美', effect: '' },
                    'Q195': { name: '沼田崎', effect: '' },
                    'Q19f': { name: '大田有里', effect: '' },
                    'Q19l': { name: '河合香奈', effect: '' },
                },
                simpleConfigTwo: {
                    'Q195': { name: '沼田崎', effect: '羁绊内英雄召唤兽全额增伤+30%' },
                }
            },

            'Q0q0': {
                textShow: [
                    [
                        '小山寿美:行空羽刃能够飞出2个飞羽造成同等伤害',
                        '金田健介:过路费每次发动技能效果额外获得4点金币',
                        '大纣豪:光索影响的范围由单位变为300范围内的所有敌人',
                        '大竹卓也:伤口恶化忽视敌人护甲20点',
                        '沢田尚子:冰爆冲击影响范围提高到600码',
                        '福田生:召唤野狼造成的伤害额外附加1000点物理伤害',
                    ],
                    ['金田健介', '大纣豪', '大竹卓也', '沢田尚子', '福田生'],
                    ['西田里', '羁绊内英雄土元素暴击几率+5%']
                ],
                simpleConfig: {
                    'Q18o': { name: '金田健介', effect: '' },
                    'Q18s': { name: '大纣豪', effect: '' },
                    'Q192': { name: '大竹卓也', effect: '' },
                    'Q19d': { name: '沢田尚子', effect: '' },
                    'Q19r': { name: '福田生', effect: '' },
                },
                simpleConfigTwo: {
                    'Q18t': { name: '西田里', effect: '羁绊内英雄土元素暴击几率+5%' },
                }
            },
        }
}