
// 装备 数据 配置
export default class Item_UI_Initialization_data {
    static item_data: {
        [id: string]: {
            // 绝对必出属性
            abs?: { [name: string]: number[], }
            // 随机属性的数量
            num?: number,
            section_data?: { [name: string]: number[], }[]
        }
    } = {
            // ***************-------------------一星---------------------
            // 菠菜   1   q0r5
            'q0r5': {
                // 必出属性
                abs: {
                    '攻击+': [500],
                    '真实伤害+': [100],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 山药   1   a2PG
            'q0r6': {
                // 必出属性
                abs: {
                    '敏捷+': [300],
                    '附加伤害+': [200],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 西红柿   1
            'q0r7': {
                // 必出属性
                abs: {
                    '智力+': [300],
                    '技能附加伤害+': [200],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 野蒜   1
            'q0r8': {
                // 必出属性
                abs: {
                    '力量+': [300],
                    '召唤物属性加成+': [3],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 香肠   1
            'q0r9': {
                // 必出属性
                abs: {
                    '生命+': [1000],
                    '充能技能伤害+': [300],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },

            // 咸鸭蛋   2
            'q0ra': {
                // 必出属性
                abs: {
                    '攻击+': [500],
                    '攻击增加攻击+': [2],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 鸡腿   2
            'q0rb': {
                // 必出属性
                abs: {
                    '敏捷+': [300],
                    '攻击增加敏捷+': [1],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 猪肉罐头   2
            'q0rc': {
                // 必出属性
                abs: {
                    '智力+': [300],
                    '攻击增加智力+': [1],

                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [
                ],
            },
            // ¤一星〈天丛云剑〉
            'q0rd': {
                // 必出属性
                abs: {
                    '力量+': [300],
                    '攻击增加力量+': [1],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // ¤一星〈红莲劫焰〉

            'q0re': {
                // 必出属性
                abs: {
                    '生命+': [1000],
                    '攻击增加生命+': [5],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },

            // ¤一星〈濑登太刀〉

            'q0rf': {
                // 必出属性         
                abs: {
                    '攻击+': [500],
                    '护甲穿透+': [4],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // ¤一星〈弥切丸〉

            'q0rg': {
                // 必出属性       
                abs: {
                    '敏捷+': [300],
                    '魔抗穿透+': [4],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 金枪鱼   3
            'q0rh': {
                // 必出属性        
                abs: {
                    '智力+': [300],
                    '物理暴击+': [20],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 大闸蟹   3
            'q0ri': {
                // 必出属性        
                abs: {
                    '力量+': [300],
                    '法术暴击+': [20],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // ¤一星〈菊一文字则宗〉
            'q0rj': {
                // 必出属性        
                abs: {
                    '生命+': [1000],
                    '召唤物继承属性加成+': [10],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            //***********************************************二星******************************************* */
            // ¤二星〈斩鬼刃〉
            'q0rk': {
                // 必出属性         
                abs: {
                    '攻击+': [1000],
                    '真实伤害+': [200],
                    '雷元素伤害+': [1000],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // ***************-------------------BBBBBBBBBBBBBB---------------------
            // 莲花座   4
            'q0rl': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '敏捷+': [600],
                    '附加伤害+': [400],
                    '火元素伤害+': [1000],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 破冰矛   4
            'q0rm': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '智力+': [600],
                    '技能附加伤害+': [400],
                    '木元素伤害+': [1000],

                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 八卦阵   4
            'q0rn': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '力量+': [600],
                    '召唤物属性加成+': [6],
                    '金元素伤害+': [1000],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 锁魂鞭   4
            'q0ro': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '生命+': [2000],
                    '充能技能伤害+': [600],
                    '土元素伤害+': [1000],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [

                ],
            },

            // 凤羽袍   5
            'q0rp': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '攻击+': [1000],
                    '攻击增加攻击+': [4],
                    '冰元素伤害+': [1000],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [

                ],
            },
            // 昆仑镜   5
            'q0rq': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '敏捷+': [600],
                    '攻击增加敏捷+': [2],
                    '水元素伤害+': [1000],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 玄牧雷   5
            'q0rr': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '智力+': [600],
                    '攻击增加智力+': [2],
                    '雷元素伤害+': [1000],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 宝葫芦   5
            'q0rs': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '力量+': [600],
                    '攻击增加力量+': [2],
                    '火元素伤害+': [1000],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 灵养液   5
            'q0rt': {
                // 必出属性         
                abs: {
                    '生命+': [2000],
                    '攻击增加生命+': [10],
                    '木元素伤害+': [1000],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 武曲刃   6
            'q0ru': {
                // 必出属性         
                abs: {
                    '攻击+': [1000],
                    '护甲穿透+': [8],
                    '金元素伤害+': [1000],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 盘龙戒   6
            'q0rv': {
                // 必出属性      
                abs: {
                    '敏捷+': [600],
                    '魔抗穿透+': [8],
                    '土元素伤害+': [1000],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 飘雪瓶   6
            'q0s0': {
                // 必出属性         
                abs: {
                    '智力+': [600],
                    '物理暴击+': [40],
                    '冰元素伤害+': [1000],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // ***************-------------------AAAAAAAAAAAAAAAA---------------------
            // 火焰谱   6
            'q0s1': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '力量+': [600],
                    '法术暴击+': [40],
                    '水元素伤害+': [1000],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 狮子锤   6
            'q0s2': {
                // 必出属性         
                abs: {
                    '生命+': [2000],
                    '召唤物继承属性加成+': [20],
                    '召唤物攻击速度+': [30],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            //*****************************************三星****************** */

            'q0s3': {
                // 必出属性         
                abs: {
                    '攻击+': [2000],
                    '真实伤害+': [400],
                    '雷元素伤害+': [2000],
                    '雷元素伤害加成+': [20],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // ***************-------------------BBBBBBBBBBBBBB---------------------
            // 莲花座   4
            'q0s4': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '敏捷+': [1200],
                    '附加伤害+': [800],
                    '火元素伤害+': [2000],
                    '火元素伤害加成+': [20],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 破冰矛   4
            'q0s5': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '智力+': [1200],
                    '技能附加伤害+': [800],
                    '木元素伤害+': [2000],
                    '木元素伤害加成+': [20],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 八卦阵   4
            'q0s6': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '力量+': [1200],
                    '召唤物属性加成+': [12],
                    '金元素伤害+': [2000],
                    '金元素伤害加成+': [20],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 锁魂鞭   4
            'q0s7': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '生命+': [4000],
                    '充能技能伤害+': [1200],
                    '土元素伤害+': [2000],
                    '土元素伤害加成+': [20],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [

                ],
            },

            // 凤羽袍   5
            'q0s8': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '攻击+': [2000],
                    '攻击增加攻击+': [8],
                    '冰元素伤害+': [2000],
                    '冰元素伤害加成+': [20],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [

                ],
            },
            // 昆仑镜   5
            'q0s9': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '敏捷+': [1200],
                    '攻击增加敏捷+': [4],
                    '水元素伤害+': [2000],
                    '水元素伤害加成+': [20],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 玄牧雷   5
            'q0sa': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '智力+': [1200],
                    '攻击增加智力+': [4],
                    '雷元素伤害+': [2000],
                    '雷元素暴击伤害加成+': [40],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 宝葫芦   5
            'q0sb': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '力量+': [1200],
                    '攻击增加力量+': [4],
                    '火元素伤害+': [2000],
                    '火元素暴击伤害加成+': [40],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 灵养液   5
            'q0sc': {
                // 必出属性         
                abs: {
                    '生命+': [4000],
                    '攻击增加生命+': [20],
                    '木元素伤害+': [2000],
                    '木元素暴击伤害加成+': [40],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // e武曲刃   6
            'q0sd': {
                // 必出属性         
                abs: {
                    '攻击+': [2000],
                    '护甲穿透+': [16],
                    '金元素伤害+': [2000],
                    '金元素暴击伤害加成+': [40],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 盘龙戒   6
            'q0se': {
                // 必出属性      
                abs: {
                    '敏捷+': [1200],
                    '魔抗穿透+': [16],
                    '土元素伤害+': [2000],
                    '土元素暴击伤害加成+': [40],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 飘雪瓶   6
            'q0sf': {
                // 必出属性         
                abs: {
                    '智力+': [1200],
                    '物理暴击+': [80],
                    '冰元素伤害+': [2000],
                    '冰元素暴击伤害加成+': [40],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // ***************-------------------AAAAAAAAAAAAAAAA---------------------
            // 火焰谱   6
            'q0sg': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '力量+': [1200],
                    '法术暴击+': [80],
                    '水元素伤害+': [2000],
                    '水元素暴击伤害加成+': [40],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 狮子锤   6
            'q0sh': {
                // 必出属性         
                abs: {
                    '生命+': [4000],
                    '召唤物继承属性加成+': [40],
                    '召唤物攻击速度+': [60],
                    '致命一击+': [2]
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },

            //********************************************************************** 四星************* */
            'q0si': {
                // 必出属性         
                abs: {
                    '攻击+': [4000],
                    '真实伤害+': [800],
                    '雷元素伤害+': [4000],
                    '雷元素伤害加成+': [40],
                    '每秒增加攻击+': [2],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // ***************-------------------BBBBBBBBBBBBBB---------------------
            // 莲花座   4
            'q0sj': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '敏捷+': [2400],
                    '附加伤害+': [1600],
                    '火元素伤害+': [4000],
                    '火元素伤害加成+': [40],
                    '每秒增加敏捷+': [1],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 破w冰矛   4
            'q0sk': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '智力+': [2400],
                    '技能附加伤害+': [1600],
                    '木元素伤害+': [4000],
                    '木元素伤害加成+': [40],
                    '每秒增加智力+': [1],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 八卦阵   4
            'q0sl': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '力量+': [2400],
                    '召唤物属性加成+': [24],
                    '金元素伤害+': [4000],
                    '金元素伤害加成+': [40],
                    '每秒增加力量+': [1],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 锁魂鞭   4
            'q0sm': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '生命+': [8000],
                    '充能技能伤害+': [2400],
                    '土元素伤害+': [4000],
                    '土元素伤害加成+': [40],
                    '每秒增加生命+': [5],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [

                ],
            },

            // 凤羽袍   5
            'q0sn': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '攻击+': [4000],
                    '攻击增加攻击+': [16],
                    '冰元素伤害+': [4000],
                    '冰元素伤害加成+': [40],
                    '生命恢复+': [100]
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [

                ],
            },
            // 昆仑镜   5
            'q0so': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '敏捷+': [2400],
                    '攻击增加敏捷+': [8],
                    '水元素伤害+': [4000],
                    '水元素伤害加成+': [40],
                    '百分比恢复生命+': [10]
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 玄牧雷   5
            'q0sp': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '智力+': [2400],
                    '攻击增加智力+': [8],
                    '雷元素伤害+': [4000],
                    '雷元素暴击伤害加成+': [80],
                    '固定值吸血+': [50]
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 宝葫芦   5
            'q0sq': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '力量+': [2400],
                    '攻击增加力量+': [8],
                    '火元素伤害+': [4000],
                    '火元素暴击伤害加成+': [80],
                    '百分比吸血+': [15]
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 灵养液   5
            'q0sr': {
                // 必出属性         
                abs: {
                    '生命+': [8000],
                    '攻击增加生命+': [40],
                    '木元素伤害+': [4000],
                    '木元素暴击伤害加成+': [80],
                    '每秒增加攻击+': [2]
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // e武曲刃   6
            'q0ss': {
                // 必出属性         
                abs: {
                    '攻击+': [4000],
                    '护甲穿透+': [32],
                    '金元素伤害+': [4000],
                    '金元素暴击伤害加成+': [80],
                    '每秒增加敏捷+': [1]
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 盘龙戒   6
            'q0st': {
                // 必出属性      
                abs: {
                    '敏捷+': [2400],
                    '魔抗穿透+': [32],
                    '土元素伤害+': [4000],
                    '土元素暴击伤害加成+': [80],
                    '每秒增加智力+': [1]
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 飘雪瓶   6
            'q0su': {
                // 必出属性         
                abs: {
                    '智力+': [2400],
                    '物理暴击+': [160],
                    '冰元素伤害+': [4000],
                    '冰元素暴击伤害加成+': [80],
                    '每秒增加力量+': [1]
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // ***************-------------------AAAAAAAAAAAAAAAA---------------------
            // 火焰谱   6
            'q0sv': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '力量+': [2400],
                    '法术暴击+': [160],
                    '水元素伤害+': [4000],
                    '水元素暴击伤害加成+': [80],
                    '每秒增加生命+': [1]
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 狮子锤   6
            'q0t0': {
                // 必出属性         
                abs: {
                    '生命+': [8000],
                    '召唤物继承属性加成+': [80],
                    '召唤物攻击速度+': [120],
                    '致命一击+': [4],
                    '召唤物护甲穿透+': [20]
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },


            //**************************五星************** */

            'q0t1': {
                // 必出属性         
                abs: {
                    '攻击+': [8000],
                    '真实伤害+': [1600],
                    '雷元素伤害+': [8000],
                    '雷元素伤害加成+': [80],
                    '每秒增加攻击+': [4],
                    '附加伤害+': [4000],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // ***************-------------------BBBBBBBBBBBBBB---------------------
            // 莲花座   4
            'q0t2': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '敏捷+': [4800],
                    '附加伤害+': [3200],
                    '火元素伤害+': [8000],
                    '火元素伤害加成+': [80],
                    '每秒增加敏捷+': [2],
                    '技能CD-': [5],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 破冰矛   4
            'q0t3': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '智力+': [4800],
                    '技能附加伤害+': [3200],
                    '木元素伤害+': [8000],
                    '木元素伤害加成+': [80],
                    '每秒增加智力+': [2],
                    '魔法恢复+': [3],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 八卦阵   4
            'q0t4': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '力量+': [4800],
                    '召唤物属性加成+': [48],
                    '金元素伤害+': [8000],
                    '金元素伤害加成+': [80],
                    '每秒增加力量+': [2],
                    '每秒增加金币+': [2],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 锁魂鞭   4
            'q0t5': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '生命+': [16000],
                    '充能技能伤害+': [4800],
                    '土元素伤害+': [8000],
                    '土元素伤害加成+': [80],
                    '每秒增加生命+': [10],
                    '每秒增加木材+': [1],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [

                ],
            },

            // 凤羽袍   5
            'q0t6': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '攻击+': [8000],
                    '攻击增加攻击+': [32],
                    '冰元素伤害+': [8000],
                    '冰元素伤害加成+': [80],
                    '生命恢复+': [200],
                    '每秒增加杀敌+': [0.1]
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [

                ],
            },
            // 昆仑镜   5
            'q0t7': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '敏捷+': [4800],
                    '攻击增加敏捷+': [16],
                    '水元素伤害+': [8000],
                    '水元素伤害加成+': [80],
                    '百分比恢复生命+': [20],
                    '攻击增加木材+': [0.1],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 玄牧雷   5
            'q0t8': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '智力+': [4800],
                    '攻击增加智力+': [16],
                    '雷元素伤害+': [8000],
                    '雷元素暴击伤害加成+': [160],
                    '固定值吸血+': [100],
                    '攻击增加金币+': [5],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 宝葫芦   5
            'q0t9': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '力量+': [4800],
                    '攻击增加力量+': [16],
                    '火元素伤害+': [8000],
                    '火元素暴击伤害加成+': [160],
                    '百分比吸血+': [30],
                    '幸运值+': [10],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 灵养液   5
            'q0ta': {
                // 必出属性         
                abs: {
                    '生命+': [16000],
                    '攻击增加生命+': [80],
                    '木元素伤害+': [8000],
                    '木元素暴击伤害加成+': [160],
                    '每秒增加攻击+': [4],
                    '召唤物数量+': [2],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // e武曲刃   6
            'q0tb': {
                // 必出属性         
                abs: {
                    '攻击+': [8000],
                    '护甲穿透+': [64],
                    '金元素伤害+': [8000],
                    '金元素暴击伤害加成+': [160],
                    '每秒增加敏捷+': [2],
                    '召唤物护甲穿透+': [40],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 盘龙戒   6
            'q0tc': {
                // 必出属性      
                abs: {
                    '敏捷+': [4800],
                    '魔抗穿透+': [64],
                    '土元素伤害+': [8000],
                    '土元素暴击伤害加成+': [160],
                    '每秒增加智力+': [2],
                    '召唤物伤害减免+': [10],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 飘雪瓶   6
            'q0td': {
                // 必出属性         
                abs: {
                    '智力+': [4800],
                    '物理暴击+': [320],
                    '冰元素伤害+': [8000],
                    '冰元素暴击伤害加成+': [160],
                    '每秒增加力量+': [2],
                    '召唤物减伤+': [1000],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // ***************-------------------AAAAAAAAAAAAAAAA---------------------
            // 火焰谱   6
            'q0te': {
                // 必出属性         攻速+,生命+,护甲+,攻击+,攻击百分比+
                abs: {
                    '力量+': [4800],
                    '法术暴击+': [320],
                    '水元素伤害+': [8000],
                    '水元素暴击伤害加成+': [160],
                    '每秒增加生命+': [10],
                    '召唤物附加伤害+': [2000],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },
            // 狮子锤   6
            'q0tf': {
                // 必出属性         
                abs: {
                    '生命+': [16000],
                    '召唤物继承属性加成+': [160],
                    '召唤物攻击速度+': [240],
                    '致命一击+': [8],
                    '召唤物护甲穿透+': [40],
                    '召唤物真实伤害+': [1000],
                },
                // 随机属性的上限
                num: 0,
                // 随机属性的种类，区间
                section_data: [],
            },



        }




























































































};





















